author: Aegix AI
date: 2026/04/29
description: Auto-generated rule autonomously created by Aegix Brain after detection
  misses or critical threat identified.
detection:
  condition: selection
  selection:
    event_type: login_failure
    source_ip: 127.0.0.1
level: critical
logsource:
  category: application
status: experimental
title: Auto Generated Rule 1 1777435969
